# Learning Pandas

##### Read the airline safety data assign to df variable and print first 5 rows with pandas function

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('airline_safety_data.txt')

In [3]:
df.head(5)

,airline,avail_seat_km_per_week,incidents_85_99,fatal_accidents_85_99,fatalities_85_99,incidents_00_14,fatal_accidents_00_14,fatalities_00_14
0,Aer Lingus,320906734,2,0,0,0,0,0
1,Aeroflot*,1197672318,76,14,128,6,1,88
2,Aerolineas Argentinas,385803648,6,0,0,1,0,0
3,Aeromexico*,596871813,3,1,64,5,0,0
4,Air Canada,1865253802,2,0,0,2,0,0

##### print last 5 rows with pandas function

In [4]:
df.tail(5)

,airline,avail_seat_km_per_week,incidents_85_99,fatal_accidents_85_99,fatalities_85_99,incidents_00_14,fatal_accidents_00_14,fatalities_00_14
51,United / Continental*,7139291291,19,8,319,14,2,109
52,US Airways / America West*,2455687887,16,7,224,11,2,23
53,Vietnam Airlines,625084918,7,3,171,1,0,0
54,Virgin Atlantic,1005248585,1,0,0,0,0,0
55,Xiamen Airlines,430462962,9,1,82,2,0,0

##### Show shape of df

In [5]:
df.shape

(56, 8)

##### Show descriptive statistics of df

In [6]:
df.describe

<bound method NDFrame.describe of                        airline  avail_seat_km_per_week  incidents_85_99  \
0                   Aer Lingus               320906734                2
1                    Aeroflot*              1197672318               76
2        Aerolineas Argentinas               385803648                6
3                  Aeromexico*               596871813                3
4                   Air Canada              1865253802                2
5                   Air France              3004002661               14
6                   Air India*               869253552                2
7             Air New Zealand*               710174817                3
8             Alaska Airlines*               965346773                5
9                     Alitalia               698012498                7
10          All Nippon Airways              1841234177                3
11                   American*              5228357340               21
12           Austrian Airlines               358239823                1
13                     Avianca               396922563                5
14            British Airways*              3179760952                4
15             Cathay Pacific*              2582459303                0
16              China Airlines               813216487               12
17                      Condor               417982610                2
18                        COPA               550491507                3
19          Delta / Northwest*              6525658894               24
20                    Egyptair               557699891                8
21                       El Al               335448023                1
22          Ethiopian Airlines               488560643               25
23                     Finnair               506464950                1
24            Garuda Indonesia               613356665               10
25                    Gulf Air               301379762                1
26           Hawaiian Airlines               493877795                0
27                      Iberia              1173203126                4
28              Japan Airlines              1574217531                3
29               Kenya Airways               277414794                2
30                        KLM*              1874561773                7
31                  Korean Air              1734522605               12
32                LAN Airlines              1001965891                3
33                  Lufthansa*              3426529504                6
34           Malaysia Airlines              1039171244                3
35      Pakistan International               348563137                8
36         Philippine Airlines               413007158                7
37                     Qantas*              1917428984                1
38             Royal Air Maroc               295705339                5
39                        SAS*               682971852                5
40               Saudi Arabian               859673901                7
41          Singapore Airlines              2376857805                2
42               South African               651502442                2
43          Southwest Airlines              3276525770                1
44       Sri Lankan / AirLanka               325582976                2
45                      SWISS*               792601299                2
46                        TACA               259373346                3
47                         TAM              1509195646                8
48          TAP - Air Portugal               619130754                0
49                Thai Airways              1702802250                8
50            Turkish Airlines              1946098294                8
51       United / Continental*              7139291291               19
52  US Airways / America West*              2455687887               16
53            Vietnam Airlines               625084918                7
54             Virgin Atlantic              1005248585                1
55             Xiamen Airlines               430462962                9

    fatal_accidents_85_99  fatalities_85_99  incidents_00_14  \
0                       0                 0                0
1                      14               128                6
2                       0                 0                1
3                       1                64                5
4                       0                 0                2
5                       4                79                6
6                       1               329                4
7                       0                 0                5
8                       0                 0                5
9                       2                50                4
10                      1                 1                7
11                      5               101               17
12                      0                 0                1
13                      3               323                0
14                      0                 0                6
15                      0                 0                2
16                      6               535                2
17                      1                16                0
18                      1                47                0
19                     12               407               24
20                      3               282                4
21                      1                 4                1
22                      5               167                5
23                      0                 0                0
24                      3               260                4
25                      0                 0                3
26                      0                 0                1
27                      1               148                5
28                      1               520                0
29                      0                 0                2
30                      1                 3                1
31                      5               425                1
32                      2                21                0
33                      1                 2                3
34                      1                34                3
35                      3               234               10
36                      4                74                2
37                      0                 0                5
38                      3                51                3
39                      0                 0                6
40                      2               313               11
41                      2                 6                2
42                      1               159                1
43                      0                 0                8
44                      1                14                4
45                      1               229                3
46                      1                 3                1
47                      3                98                7
48                      0                 0                0
49                      4               308                2
50                      3                64                8
51                      8               319               14
52                      7               224               11
53                      3               171                1
54                      0                 0                0
55                      1                82                2

    fatal_accidents_00_14  fatalities_00_14
0                       0                 0
1                       1                88
2                       0                 0
3                       0                 0
4                       0                 0
5                       2               337
6                       1               158
7                       1                 7
8                       1                88
9                       0                 0
10                      0                 0
11                      3               416
12                      0                 0
13                      0                 0
14                      0                 0
15                      0                 0
16                      1               225
17                      0                 0
18                      0                 0
19                      2                51
20                      1                14
21                      0                 0
22                      2                92
23                      0                 0
24                      2                22
25                      1               143
26                      0                 0
27                      0                 0
28                      0                 0
29                      2               283
30                      0                 0
31                      0                 0
32                      0                 0
33                      0                 0
34                      2               537
35                      2                46
36                      1                 1
37                      0                 0
38                      0                 0
39                      1               110
40                      0                 0
41                      1                83
42                      0                 0
43                      0                 0
44                      0                 0
45                      0                 0
46                      1                 3
47                      2               188
48                      0                 0
49                      1                 1
50                      2                84
51                      2               109
52                      2                23
53                      0                 0
54                      0                 0
55                      0                 0  >

#### Show df column informations

In [7]:
df.columns

Index(['airline', 'avail_seat_km_per_week', 'incidents_85_99',
       'fatal_accidents_85_99', 'fatalities_85_99', 'incidents_00_14',
       'fatal_accidents_00_14', 'fatalities_00_14'],
      dtype='object')

#### Select companies and incidents_85_99 with incidents_85_99 is less than 10

In [8]:
filtered_df = df[df["incidents_85_99"] < 10][["airline", "incidents_85_99"]]
print(filtered_df)

                   airline  incidents_85_99
0               Aer Lingus                2
2    Aerolineas Argentinas                6
3              Aeromexico*                3
4               Air Canada                2
6               Air India*                2
7         Air New Zealand*                3
8         Alaska Airlines*                5
9                 Alitalia                7
10      All Nippon Airways                3
12       Austrian Airlines                1
13                 Avianca                5
14        British Airways*                4
15         Cathay Pacific*                0
17                  Condor                2
18                    COPA                3
20                Egyptair                8
21                   El Al                1
23                 Finnair                1
25                Gulf Air                1
26       Hawaiian Airlines                0
27                  Iberia                4
28          Japan Airlines                3
29           Kenya Airways                2
30                    KLM*                7
32            LAN Airlines                3
33              Lufthansa*                6
34       Malaysia Airlines                3
35  Pakistan International                8
36     Philippine Airlines                7
37                 Qantas*                1
38         Royal Air Maroc                5
39                    SAS*                5
40           Saudi Arabian                7
41      Singapore Airlines                2
42           South African                2
43      Southwest Airlines                1
44   Sri Lankan / AirLanka                2
45                  SWISS*                2
46                    TACA                3
47                     TAM                8
48      TAP - Air Portugal                0
49            Thai Airways                8
50        Turkish Airlines                8
53        Vietnam Airlines                7
54         Virgin Atlantic                1
55         Xiamen Airlines                9

#### Group companies by first letter(lower) and take the mean incidents_85_99 and make it a dataframe again

In [9]:
grouped_df = (
    df.groupby(df["airline"].str[0].str.lower())["incidents_85_99"]
    .mean()
    .reset_index()
    .rename(columns={"airline": "first_letter", "incidents_85_99": "mean_incidents_85_99"})
)

In [10]:
print(grouped_df)

   first_letter  mean_incidents_85_99
0             a             10.714286
1             b              4.000000
2             c              4.250000
3             d             24.000000
4             e             11.333333
5             f              1.000000
6             g              5.500000
7             h              0.000000
8             i              4.000000
9             j              3.000000
10            k              7.000000
11            l              4.500000
12            m              3.000000
13            p              7.500000
14            q              1.000000
15            r              5.000000
16            s              3.000000
17            t              5.400000
18            u             17.500000
19            v              4.000000
20            x              9.000000